{
  "ddlj": "Alright, snuggle up little ones, pull those blankets up nice and cozy, and let me tell you about two best friends, a very silly mix-up, and the longest, most adventurous train journey you can possibly imagine. Ready? Here we go.\n\nOnce upon a time, in the big, bustling, absolutely wonderful city of London, there lived a boy named Raj. Now Raj was... how do I put this nicely... a little bit of a goofball. A loveable goofball, but still a goofball. He was always late, always laughing, always getting into some sort of silly situation. His dad, a big warm teddy bear of a man, would shake his head and chuckle at him every single day. Raj had grown up in London, but his dad always told him stories about their home country of India, about the golden fields of Punjab, about the music and the colours and the festivals. And even though Raj had never been there, those stories made his heart feel all warm and glowy inside.\n\nNow across the city, in another cozy little house, lived a girl named Simran. Simran was wonderful. She was brave and smart and had the most sparkly imagination you have ever seen. She would daydream about adventures, about wide open spaces, about seeing the whole wide world. Her dad, whose name was Bauji, loved her very very much, but he was also, and I say this kindly, a little bit stubborn. Like a very loveable, very confused goat who had made up his mind about something and simply would not budge. Can you imagine? He had already decided that when Simran grew up, she would go to India and marry a boy from their village back home, a boy she had never even met. Poor Simran.\n\nBut before any of that happened, something exciting was on the horizon. A trip! A grand, glorious, Europe trip with a whole group of friends for a whole month. Trains and mountains and castles and beautiful countryside, oh my!\n\nAnd guess what happened? Raj was going on the VERY SAME TRIP. What are the chances!\n\nNow the trip started off a little rocky, mostly because Raj, being Raj, was late to the train station. He came running and puffing and sliding across the platform with his enormous backpack wobbling all over the place, and he just barely leaped onto the train as it was pulling away. Simran, who was already sitting very properly in her seat, watched this whole performance and thought, this boy is an absolute disaster. And honestly? She was not entirely wrong.\n\nBut here is the thing about trips, my sleepy little ones. When you spend a whole month travelling with someone, seeing beautiful snowy mountains and cobblestone streets and twinkling little towns, sometimes the person you thought was an absolute disaster turns out to be your very best friend. Raj made Simran laugh until her tummy hurt. He knew all the funniest games, all the best songs, and he always somehow found the best food in every single city they visited. Simran showed Raj how to actually look at things, to really see them, to notice the beautiful little details he was always too busy goofing around to see. They were, in a word, the most perfect pair of best friends the world had ever produced.\n\nThey explored and adventured and had the most magical time. They got lost in the Swiss mountains once, which sounds scary but was actually hilarious because Raj's GPS was completely upside down the whole time and they still somehow ended up at the most beautiful lake you have ever seen in your life. They danced in the rain in Paris. They watched the stars from a tiny little village in Austria and talked about all their biggest dreams.\n\nAnd then, as all wonderful things do, the trip ended.\n\nAnd that is when the real adventure began.\n\nBecause Simran went home and her dad announced it was time to pack up everything, leave London, and move to India so she could meet the boy from the village she was supposed to be friends with forever. His name was Kuljeet. Now Kuljeet was not mean, exactly. He was just... let me think of the right word... magnificently clueless. He strutted around like a rooster who thought he was the most important rooster in the entire barnyard. He had big hair and a very loud laugh and was absolutely convinced that everyone in the world found him as wonderful as he found himself. Can you imagine? Hilarious.\n\nSimran was very sad. She did not want to leave. She did not want to be best friends with a strutting rooster boy she had never met. She wanted to go on more adventures. She wrote in her diary and looked out the window and missed her fun, goofy, wonderful friend Raj terribly.\n\nBut then! THEN! Guess what happened!\n\nRaj showed up.\n\nBecause THAT is what best friends do.\n\nRaj had been thinking about everything, about their adventures and their conversations and how Simran was the most genuinely wonderful person he had ever known, and he thought, I am not going to just let my best friend disappear to another country forever. No no no. So he packed his bag, told his dad the whole story, and his dad, the big warm teddy bear, grabbed his OWN bag and said, I am coming too, obviously.\n\nSo off they went to Punjab, India. The golden fields! The colours! The music! Everything his dad had always told him about, right there in front of his eyes. It was even more beautiful than the stories.\n\nNow the tricky part was that Simran's dad, Bauji, did not know Raj. And Bauji had, as we mentioned, made up his mind about things in a very goat-like way. So Raj could not simply walk up and say, hello sir, I am Simran's best friend, please reconsider your plans. That would not work at all.\n\nSo instead, Raj did something clever. He decided to become part of the village, to help out, to show everyone what kind of person he really was. He helped with the farm work. He fixed things that were broken. He joined in the celebrations with so much joy and enthusiasm that everyone in the whole village absolutely adored him. Even Bauji secretly thought this boy had a very good heart, although he was not quite ready to admit that yet because, well, goat.\n\nKuljeet, meanwhile, was busy being magnificently useless. He kept trying to show off and things kept going hilariously wrong. He tried to lift a very heavy bag to impress everyone and dropped it directly on his own foot. He tried to ride a horse and the horse looked at him, decided absolutely not, and walked away. He was not bad. He was just wonderfully, completely, perfectly silly.\n\nNow Simran's mum, she was smart. Mums always are, right? She could see exactly what was happening. She saw how happy Simran was whenever Raj was around, how her eyes sparkled and she actually laughed again for the first time in weeks. And she thought, hmm, I think I need to have a quiet word with Bauji.\n\nAnd the word she had was this. She said, do you remember why you left India all those years ago? You wanted a better life. You wanted Simran to be happy. And happiness, my dear stubborn wonderful husband, is standing right there in that field helping old Mr. Singh fix his fence.\n\nBauji went very quiet.\n\nHe stood at the window and he watched Raj in the field, working hard, laughing with the neighbours, being so completely and genuinely himself. And something in that stubborn goat heart of his went soft. Just a little. Like a biscuit that has been sitting near a warm cup of tea.\n\nAnd then came the most important moment of the whole story.\n\nSimran came to say goodbye to Raj, because she thought it was over, she thought he would have to go home. But Raj said no. He said he was going to do this properly. He walked right up to Bauji, looked him in the eye, and said, I am not going anywhere without your blessing. Because your daughter is my very best friend in the whole world and I will wait right here for as long as it takes for you to see that.\n\nThere was a very long pause.\n\nAnd then Bauji, that wonderfully stubborn man, looked at his daughter's face, bright and hopeful and so full of life, and he looked at this silly brave boy who had crossed the world for her, and something finally clicked loose inside him.\n\nHe nodded. And he said, ja, Simran. Go.\n\nAnd Simran ran.\n\nShe ran to catch the train that was just beginning to pull away, and Raj reached out his hand, and she grabbed it, and off they went into the most wonderful future you can possibly imagine. Best friends. Adventure partners. Two people who had found in each other something that made the whole world feel bigger and warmer and full of possibilities.\n\nAnd back in the village, Bauji smiled a very small, very quiet smile. And Kuljeet tripped over absolutely nothing and fell into a hay bale. And everyone had a lovely cup of chai.\n\nNow then, my little ones. The fields of Punjab are very quiet tonight. The train is rocking gently on the tracks. Raj and Simran are watching the stars go by through the window, just like they did in Austria, and everything is perfectly, wonderfully fine.\n\nYou close your eyes now. Think of all the adventures waiting for you. Think of the friends who will make you laugh until your tummy hurts. Think of the big beautiful world out there, full of golden fields and snowy mountains and trains going clickety clack into the dark.\n\nSleep tight. I love you to the moon and all the way back. Goodnight.",
  "sholay": "Alright, snuggle up little ones, pull those blankets up nice and tight, and let me tell you one of my absolute favourite stories. It's about friendship, and bravery, and a very, very silly bad guy who could never quite get things right. Are you ready? Good. Close your eyes if you want, but keep your ears wide open.\n\nOnce upon a time, in a little village called Ramgarh, tucked between big golden hills and dusty winding roads, there lived a kind and wise old man named Thakur. Now Thakur had a magnificent white moustache — the kind that wiggled when he talked — and he loved his village more than anything in the whole wide world. He was like the grandfather everyone wished they had. The kind who always had a sweet in his pocket and a story on his lips.\n\nBut Ramgarh had a problem. A big, silly, ridiculous problem. And that problem had a name. His name was Gabbar.\n\nNow listen, Gabbar thought he was very, very scary. He wore dusty old clothes and had a big loud laugh that went \"Ha ha ha HA!\" and he stomped around the hills with his gang of bumbling, clumsy followers. Can you imagine? His gang was always tripping over their own feet, dropping things, and arguing about whose turn it was to make the tea. They were, honestly, more like a group of confused pigeons than actual bad guys. But they made a lot of noise, and they kept bothering the people of Ramgarh, stealing their vegetables and scaring their goats, and that was not very nice at all.\n\nSo Thakur came up with a brilliant plan. He was going to find two of the cleverest, funniest, most adventurous friends in the whole country and ask them to come to Ramgarh and sort Gabbar out once and for all. And he knew just who to call.\n\nTheir names were Jai and Veeru.\n\nOh, these two. Where do I even begin? Jai and Veeru were best friends — the absolute best kind of best friends. The kind who finished each other's sentences and made each other laugh until their tummies hurt. Jai was quiet and clever, always thinking, with a little harmonica that he played the most beautiful tunes on. And Veeru was loud and bouncy and enthusiastic, the kind of boy who would jump into a pile of leaves just because it was there. Together, they were completely unstoppable.\n\nThakur went and found them and said, \"Boys, I need your help. My village needs clever people, not just strong people. Will you come?\" And Jai and Veeru looked at each other, grinned those big matching grins, and said, \"We're in!\"\n\nSo off they went, rattling along on a train toward Ramgarh, already joking and laughing and probably eating too many snacks. When they arrived at the village, everyone peeked out from behind their doors. The village had been so quiet and nervous for so long that they'd almost forgotten what laughter sounded like.\n\nBut Jai and Veeru brought the laughter back.\n\nVeeru, bless him, immediately became best friends with absolutely everyone. He befriended the horses, he made friends with the children who followed him around like little ducklings, and he struck up the most wonderful, giggly friendship with a cheerful young woman named Basanti who drove a horse cart and talked — oh my goodness — she talked more than anyone you have ever met in your life. She could talk about anything! The weather, the horse, the road, a leaf she saw, a cloud that looked like a fish. Veeru thought she was absolutely wonderful, and they became the silliest, funniest pair of friends, always chattering away together.\n\nAnd Jai, quiet lovely Jai, he found a friend too. Her name was Radha, and she was gentle and soft-spoken and kind. She didn't say much, but when she did, every word mattered. Jai would sit on the steps in the evenings and play his harmonica, and Radha would sit nearby, and they didn't even need to talk. That's the best kind of friendship, isn't it? When you can just sit quietly with someone and feel completely happy.\n\nNow, meanwhile, Gabbar had heard that two clever strangers had come to Ramgarh. And did this worry him? Well, it should have. But instead, Gabbar puffed out his chest and said, \"HA! Two strangers? I am GABBAR! Nobody can outsmart ME!\" And his gang all nodded and clapped, even though two of them bumped heads doing it.\n\nGabbar kept sending his gang into the village to cause trouble. But every single time, Jai and Veeru were ready. And here's the thing — they never fought Gabbar's gang the boring way. Oh no. They used tricks and cleverness and an awful lot of silliness.\n\nOne time, Gabbar's gang came stomping into the village, trying to look menacing, and Veeru had sneakily tied all their bootlaces together. Can you imagine? They got about three steps before they all went tumbling into a big heap like a pile of socks falling out of a drawer. The whole village giggled from behind their windows.\n\nAnother time, Jai played such a spooky, mysterious tune on his harmonica in the dark that Gabbar's gang became completely convinced the hills were haunted. They ran all the way back to their hideout, tripping over rocks, with their hats flying off their heads. Gabbar was furious, but what could he do? His gang was hiding under their blankets.\n\nSlowly, slowly, something magical started happening in Ramgarh. The people began to come out of their houses. They started talking to each other again. They began to smile. Children played in the streets. The old women brought out their best recipes. There was music and colour and the smell of good food drifting through the village in the evenings. Jai and Veeru hadn't just come to deal with a silly bad guy — they had brought an entire village back to life.\n\nThakur watched all of this with his magnificent wiggling moustache and felt very proud indeed.\n\nBut Gabbar was getting more and more frustrated. His plans kept failing. His gang kept coming back with ripped trousers and dented hats and silly stories about harmonicas and haunted hills. Finally, he stomped his feet and said, \"ENOUGH! I will come up with the most brilliant plan anyone has ever seen!\" His gang all looked at each other nervously because Gabbar's brilliant plans had a funny way of going very, very wrong.\n\nAnd this one was no different.\n\nGabbar's grand plan involved sneaking into the village during the big harvest festival when everyone was celebrating. But Jai and Veeru had known something was coming. They were clever like that. So they prepared the whole village. Everyone had a job. The children were in charge of making noise with pots and pans. The old women were in charge of the water buckets. Basanti, wonderfully unstoppable Basanti, was in charge of creating a distraction — and if you've ever met someone like Basanti, you'll know that a distraction is absolutely her speciality.\n\nWhen Gabbar and his bumbling gang crept into the village, they walked straight into the most magnificent, chaotic, wonderful confusion they had ever seen. Pots were banging, water was splashing everywhere, Basanti was talking at approximately a million words per minute, and Jai and Veeru appeared from two different directions at exactly the same moment, which completely baffled everyone because how did they always know?\n\nIt was a magnificent muddle. Gabbar's gang slipped, stumbled, got splashed, got completely confused, and ended up sitting in a big bewildered bunch in the middle of the village square, looking very sorry for themselves. Gabbar himself had somehow ended up with a bucket stuck on his foot.\n\nThe whole village came out and looked at him. And then someone started laughing. And then someone else. And soon everyone was laughing, because honestly, a villain with a bucket on his foot is very hard to take seriously.\n\nGabbar looked around at all the laughing faces, and at his hopeless gang, and at Jai and Veeru grinning at him, and something in him sort of... deflated. Like a balloon that had been puffed up too big. He was taken away to be looked after by people who could help him learn to be better, and the hills around Ramgarh became peaceful again.\n\nThat night, the whole village celebrated. There were lights strung everywhere, and wonderful food, and music, and Veeru danced so enthusiastically that he knocked over a table, which was very on-brand for Veeru. Jai played his harmonica, and it was the most beautiful sound floating up into the night sky, like a little piece of happiness sent up to the stars.\n\nThakur stood in the middle of it all, his moustache wiggling with joy, watching his village alive and bright and full of laughter. He looked at Jai and Veeru and felt something so warm in his heart that he could barely find the words. He didn't need many. He just said, \"Thank you, boys.\" And that was enough.\n\nJai and Veeru looked at each other, and then at Ramgarh, all lit up and glowing in the night, full of the people they'd come to love. And they knew that this little dusty village between the golden hills had become something very precious to them. A home away from home.\n\nAnd somewhere out in those quiet peaceful hills, a little harmonica tune drifted on the warm breeze.\n\nNow then, my darling ones, the village of Ramgarh went to sleep that night feeling safe and happy and loved. The stars were out, very bright, watching over everyone. The horses were resting. The children were tucked in, just like you are now.\n\nYour eyes are getting heavy, aren't they? I can see that. That's good. That's just right.\n\nRemember, the bravest thing you can do is be kind. And the cleverest thing you can do is make people laugh. And the very best thing in the whole wide world is to have a really, truly wonderful friend.\n\nSleep now, little ones. The stars are watching. Goodnight.",
  "3idiots": "Alright, snuggle up little ones, pull that blanket up nice and cozy, and let me tell you about three of the best friends the world has ever seen. Are you ready? Good. Close your eyes and imagine a big, grand school — the kind with tall buildings and long corridors and very, very serious professors who think laughing is basically against the rules.\n\nThis school was called ICE, the Imperial College of Engineering, and it was full of the smartest kids in all of India. Everyone there was trying to be the best, studying all night long, memorizing enormous books thick as your pillow. But among all those serious students, there were three friends who were about to turn the whole place upside down — in the most wonderful way.\n\nTheir names were Rancho, Farhan, and Raju.\n\nNow Rancho — oh, you would have LOVED Rancho. He had this big bright smile and a brain that worked like a magic machine. But the thing about Rancho was that he didn't just memorize things. He actually understood them. He asked questions like \"But WHY does it work that way?\" instead of just writing things down without thinking. Can you imagine? In a school full of people copying from books, here was this one boy who wanted to actually figure things out for himself.\n\nFarhan was Rancho's best friend and roommate. He had a secret — a beautiful, wonderful secret he hadn't told anyone. Farhan didn't actually want to be an engineer at all. What he really, truly loved with his whole heart was taking pictures of animals. Wildlife photography! He had a big dream of travelling through jungles and forests and photographing tigers and elephants and colorful birds. But his papa wanted him to be an engineer, so here he was, sitting in lectures about machines and circuits with a slightly sad look on his face.\n\nAnd then there was Raju. Oh, sweet Raju. He worried about EVERYTHING. He wore little rings on his fingers for good luck and prayed every single morning because he was so scared of failing. His family back home needed him to do well, and that thought sat on his shoulders like a heavy, heavy backpack that he carried everywhere.\n\nThese three boys shared a little room together and became the best of friends. They laughed together, they ate together, they stayed up late talking about their dreams. Rancho always told his friends — \"All is well! All is well!\" Whenever things felt scary or hard, he'd say it, and somehow, it actually helped. It was like a little magic spell.\n\nNow. The head of the school — the director, whose name was Viru Sahastrabuddhe, but everyone secretly called him Virus — was the silliest, most bumbling, most pompous man you have ever seen in your life. He walked around with his chest puffed up like a pigeon and he had this enormous mustache that wiggled when he was cross, which was basically always. He wore the same stiff, starched clothes every day and he had a very loud, very squeaky voice that he used mostly for telling students they were doing everything wrong.\n\nVirus believed that life was a race. First place was everything! Second place was nothing! He'd hold up two flowers — one that survived and one that got eaten by a bug — and say the bug was the world and you had to be the strong flower. The bug is coming! Study harder! The bug is the world! Rancho once pointed out that actually, both flowers are important to nature, and Virus turned absolutely purple with outrage. His mustache wiggled SO hard. It was quite something to see.\n\nVirus had a star student named Chatur — oh, Chatur was a piece of work. He had memorized practically every textbook ever written but he didn't understand a single thing in any of them. He called himself the Silencer and walked around with a very smug look on his face, convinced he was going to be the most successful person who ever lived. He and Rancho had a friendly little rivalry, which mostly involved Chatur announcing how great he was and Rancho nodding politely while trying not to giggle.\n\nOne time, there was a big speech competition, and Chatur practiced his speech over and over and over. But Rancho — being the clever, mischievous fellow he was — sneakily swapped some of the words in Chatur's speech with silly, ridiculous words. So there stood Chatur in front of the entire school, all proud and puffed up, and he gave this speech full of completely nonsense words without even realizing it. The whole hall burst out laughing. Even some of the professors had to hide their smiles. Chatur finished his speech with a big proud bow, completely confused about why everyone was in stitches. Rancho and Farhan and Raju were in the very back row, crying happy tears.\n\nBut here's where the story gets really important, little ones. Because underneath all the fun and the laughter, Rancho was always trying to tell his friends something. He'd say — don't chase success. Chase your passion. Do what you love with your whole heart, and success will come running after you. It was such a simple idea, but it was the most important idea in the whole world.\n\nFarhan finally, finally found the courage to tell his papa the truth. He sat him down and he said — Papa, I love you and I know you worked so hard for me, but I don't want to be an engineer. I want to photograph animals. I want to go into the jungle with a camera and capture the most beautiful pictures the world has ever seen. And do you know what? His papa looked at him for a long, long moment. And then — because fathers love their children even when it's hard — he said yes. He said yes, my son, follow your dream. And Farhan cried happy tears and Rancho and Raju jumped around the room like absolute silly beans, celebrating.\n\nRaju's story was harder, because Raju was so scared. He was so scared of failing that he couldn't do anything right. He'd sit in exams with his hands shaking. He'd worry so much at night that he couldn't sleep. And one day, things got so hard that it felt like the end of the world for Raju.\n\nBut then something extraordinary happened. Raju woke up, and his two best friends were right there beside him. They hadn't left. They were sitting there, holding his hand, making him laugh, telling him stories, reminding him that he mattered — not because of his grades, but because he was RAJU, their wonderful, kind, funny, worrying friend. And slowly, slowly, Raju started to believe it. He stopped being so scared. He walked into his next big test and instead of trembling, he was calm. He answered every question with a clear head and a peaceful heart. And guess what? He did wonderfully. Because when you stop being afraid, you can finally show the world what you've got.\n\nNow, there came a very dramatic night — oh, you would not believe this part — when there was the most enormous thunderstorm, and Virus's daughter needed help, and there wasn't a proper doctor around, and who saved the day using actual engineering and science and cleverness? Rancho. He used the things he'd actually learned and understood to help, right there in the middle of all that chaos. Virus stood there afterward with his mustache completely still for once, looking at this young man who'd done something real and important with his knowledge, and for the very first time, something softened in that stiff old director.\n\nAnd then Rancho disappeared.\n\nJust like that, after they all graduated, Rancho was gone. Farhan and Raju looked everywhere but couldn't find him. Years passed. Farhan became a famous wildlife photographer — his pictures were in magazines all around the world. Raju became a confident, happy engineer who smiled easily and didn't shake anymore. But they missed their friend. They missed him every single day.\n\nAnd then — THEN — Chatur came back, all grown up and still as smug as ever, saying he'd found Rancho and they should all go see him. He was convinced Rancho had failed in life. He drove them all the way to a tiny school in the most beautiful, faraway village you can imagine — green hills and blue sky and children running everywhere.\n\nAnd there was Rancho. Except — surprise of all surprises — that wasn't even his real name! His real name was a long, complicated, wonderful name, but everyone who loved him just called him Rancho. And here he was, running a little school for village children, inventing things, teaching kids to think and question and wonder, just like he always had. All around him, children were laughing and learning and building things. He was doing exactly what he loved, and he was the happiest person in the whole wide world.\n\nFarhan and Raju ran to him. They hugged for so long. There were tears and laughter all mixed up together, the way the best reunions always are. And Chatur stood there with his mouth hanging open, because this man he thought had failed had actually created something more beautiful than any fancy job or big salary could ever be.\n\nAnd the lesson, my darlings, the lesson that Rancho had been teaching his friends all along, finally made complete, perfect, wonderful sense. Don't run the race everyone else is running. Find the thing that makes your heart sing. Be curious. Be kind. Be brave enough to be yourself.\n\nAll is well.\n\nAll is well.\n\nNow you close those eyes, my little ones. Think about the things that make YOU happy — the things you love, the questions you want to ask, the dreams tucked up inside you like little seeds waiting to grow.\n\nThe stars are out. The whole world is quiet. Rancho and Farhan and Raju are somewhere out there, happy and together.\n\nAnd you, my darling, are safe and loved and wonderful.\n\nSweet dreams. All is well. All is very, very well.",
  "kkhh": "Alright, snuggle up little ones, pull those blankets nice and tight, and let me tell you a wonderful story about friendship, and feelings, and a little bit of magic that happens when people truly care about each other. Ready? Here we go.\n\nOnce upon a time, in a big, beautiful college called St. Xavier's, there were two very best friends in the whole wide world. Their names were Rahul and Anjali. Now, these two were absolutely inseparable. Like peanut butter and jam. Like stars and the night sky. Like you and your favourite stuffed animal that you absolutely cannot sleep without. They did everything together — they played basketball, they got into silly little bits of mischief, they laughed so loud that teachers would poke their heads out of classrooms just to see what all the noise was about.\n\nRahul was the kind of boy who was funny and charming and always had the biggest smile in any room. And Anjali, oh Anjali was something else entirely. She was loud and wonderful and brave, and she wore her hair in these two little braids and ran around in her tracksuit like she owned the whole basketball court. And honestly? She kind of did.\n\nNow, these two friends had the most magical friendship you could imagine. Until one day, a new girl arrived at the college. Her name was Tina. And Tina was very pretty and very kind, and she wore lovely clothes and spoke in this soft, gentle way that made everyone turn and look. Can you imagine being the new kid like that? A little bit terrifying, honestly.\n\nWell, Rahul and Tina became very good friends very quickly. They liked the same songs, they laughed at the same jokes, and before long, Rahul was spending more and more time with Tina. And poor Anjali, well, she started to feel a little bit left out. A little bit forgotten. You know that feeling when your best friend starts playing with someone else at recess and you're standing there not quite knowing what to do with your hands? Yes, that feeling. That's exactly what Anjali felt.\n\nAnd because Anjali had such a big, big heart, and because she didn't quite know how to say \"hey, I miss you, I feel a bit sad,\" she decided the bravest thing she could do was step back. She quietly packed up her heart, kept her chin up, and eventually she left the college and moved far away. And Rahul, who was so wrapped up in his new friendship with Tina, didn't quite realise until it was too late just how much he missed his very best friend in the whole world.\n\nNow here's where the story gets really interesting, so don't you dare fall asleep just yet.\n\nRahul and Tina grew up, and they had a tiny little baby girl. They named her Anjali. Isn't that sweet? He named her after his old best friend, because even after all those years, he never quite forgot her. But very sadly, Tina became very ill, and she passed away when little Anjali was just a baby. Before she went, though, Tina did something absolutely extraordinary. She wrote her daughter eight letters. One for every birthday, so that even when she wasn't there, her love would still find little Anjali every single year. Isn't that one of the most beautiful things you've ever heard?\n\nSo little Anjali grew up with her papa Rahul and her dadi, which means grandma, who was the most wonderfully dramatic grandma you have ever seen in your life. Dadi wore big sparkly saris and had very strong opinions about everything and she was absolutely hilarious. She once dramatically fainted onto a velvet sofa just because someone served her the wrong kind of tea. Just imagine that. A full, theatrical swoon. Over tea.\n\nNow, when little Anjali turned eight years old, she opened her eighth letter from her mama Tina. And in that letter, Tina had written something magical. She told her daughter that her papa, Rahul, needed a best friend again. She said that somewhere out there was a woman named Anjali, the original Anjali, who had once been his very dearest friend, and that little Anjali should go and find her. Because her papa deserved to have that kind of friendship and happiness again.\n\nCan you believe that? A letter from a mama who loved her family so much that she was still looking after them even from far, far away.\n\nSo little Anjali, who was brave and determined and absolutely her father's daughter in the very best way, decided she was going to find the original Anjali. She was going to find her papa's long lost best friend if it was the last thing she did.\n\nWith the help of her wonderful, wonderfully nosy grandma dadi, who was thrilled about this whole adventure because it meant she got to be dramatic about something, little Anjali tracked down the original Anjali. And guess what? Grown up Anjali was working as a camp counsellor at a lovely summer camp in Shimla, up in the beautiful mountains where everything smells like pine trees and cold fresh air.\n\nLittle Anjali packed her bags, went to the camp, and there she met the original Anjali, who was now a tall, beautiful, wonderful woman. And the moment little Anjali saw her, she just knew. You know how sometimes you meet someone and it feels like you've known them forever? Just like that.\n\nBut wait. Guess what happened next. There was a small, slightly silly problem.\n\nGrown up Anjali was almost engaged to a man named Aman. Now Aman was a very nice fellow, very cheerful, very enthusiastic, always smiling an enormous smile that took up most of his face. He meant very well. But here's the thing about Aman — he was a tiny bit clumsy and a little bit goofy, and whenever he tried to be impressive he would somehow end up tripping over something or saying exactly the wrong thing at exactly the wrong moment. He once tried to make a grand romantic gesture with a bunch of balloons and accidentally let them all go at once so they floated away into the sky. He just stood there watching them drift off with this baffled expression. Very sweet man, very disaster-prone.\n\nLittle Anjali liked Aman, she really did. But she had a mission. She wanted her papa and her best friend, grown up Anjali, to find each other again. She wrote to her papa. She sent him messages. She told him where she was. She practically drew him a map with a big shiny star on it that said \"come here immediately, papa.\"\n\nAnd Rahul came.\n\nAnd the moment Rahul and Anjali saw each other again after all those years, it was like watching two puzzle pieces click back into place. All those years of missing each other, all those quiet moments of wondering whatever happened to that best friend, all of that just sort of melted away. They laughed together like no time had passed at all. They remembered all their old silly jokes. They finished each other's sentences. They played basketball again, and Anjali was still absolutely brilliant at it, by the way.\n\nNow, Aman, bless his heart, could see what was happening. He could see that these two people had a friendship so deep and so real that it had survived years and years of being apart. And even though he was a little bit sad, because he really did care about Anjali, Aman was also a genuinely good person. He pulled Anjali aside one day, gave her his biggest, goofiest grin, and said, in his cheerful bumbling way, that he just wanted her to be happy. And then he tripped over a garden hose on the way out, which was very him, and everyone laughed including him, which was also very him.\n\nAnd so, with Aman's kind blessing, and with little Anjali jumping up and down and cheering so enthusiastically she nearly fell into the fountain, Rahul and Anjali promised each other they would never lose touch again. That they would always be there for each other. That friendship, real true friendship, is one of the most precious things in the whole wide world and you should hold onto it with both hands.\n\nDadi, when she heard the news, dramatically collapsed onto a chair with her hand on her heart and declared it was the happiest day of her entire magnificent life. Then she asked if there was cake. There was cake. Everything was wonderful.\n\nAnd little Anjali, that brave, determined, extraordinary little girl who had carried her mama's letter in her heart and set off on the most important mission in the world, she curled up that night in her camp bed and looked up at the stars through the window. And she whispered goodnight to her mama, somewhere up there among them, and she said thank you. Because somehow, because of love that never really goes away, her family was whole and happy and full of laughter again.\n\nAnd somewhere, floating gently through the night sky, Aman's balloons were still drifting along having a perfectly lovely time.\n\nNow then, little ones. Your eyes are getting heavy, aren't they? That's alright. Let your eyelids flutter closed. Think about the people you love most, the friends who make you laugh, the family who holds you close. That love is always there, even when it's quiet, even when people are far away. It never really leaves.\n\nJust like the stars.\n\nJust like a letter written with all the love in the world.\n\nSweet dreams, my darlings. Sleep tight now. I love you so very much.",
  "lagaan": "Alright, snuggle up little ones, pull those blankets up nice and cozy, and let me tell you a wonderful story about a little village, a very silly man, and the most exciting cricket match that ever, ever happened in the whole wide world. Ready? Here we go.\n\nOnce upon a time, in a beautiful village called Champaner, tucked away in the sunny hills of India, there lived a cheerful young man named Bhuvan. Bhuvan had the biggest smile you ever saw, hair that was always a little messy, and a heart so full of courage it could barely fit in his chest. He loved his village more than anything. He loved the people, the little houses, the dusty fields, and even the stubborn old ox who refused to walk in a straight line.\n\nNow, the village of Champaner had a little problem. Well, actually a rather big problem. There was a man called Captain Russell who lived in a fancy fort nearby and thought he was terribly, terribly important. Captain Russell wore a stiff uniform, had a moustache that curled up at the ends like two little snails, and he walked around with his nose so high in the air that he probably couldn't even see his own boots. Can you believe that?\n\nCaptain Russell had decided that the villagers had to pay something called lagaan. Lagaan was like a big pile of grain that the villagers had to hand over every single year. And that year, because the rains hadn't come and the crops were sad and droopy, the villagers were having an enormously hard time. Bhuvan went to the Captain and very politely said, please sir, could we perhaps not pay the lagaan this year? Our tummies are rather empty already.\n\nAnd do you know what Captain Russell did? He twirled his silly moustache, puffed up his chest like a big pompous pigeon, and said no. Not only no, but he said the villagers would have to pay DOUBLE the lagaan. Double! Oh, he was so very pleased with himself about that. He even did a little self-satisfied chuckle. He was not a very nice man, but he was also not a very smart one, which is important to remember.\n\nBut then, oh but then, Captain Russell had another idea. He pointed out to the cricket field behind his fort and he said, I'll tell you what. My soldiers and I will play a cricket match against your little village. If you win, nobody in the whole region pays any lagaan for three whole years. Three whole years! But if you lose, you pay three times the lagaan. Three times!\n\nThe whole village gasped. The old men shook their heads. The aunties looked worried. Nobody in Champaner had ever even played cricket before. They didn't even know what cricket was! It was a game the British soldiers played with a bat and a ball, and it looked very confusing and very difficult.\n\nEveryone told Bhuvan, no no no, don't agree to this, it's a terrible idea. But Bhuvan looked at his village, looked at his friends, looked at the sad hungry faces around him, and he thought, we can do this. We just have to learn. And so, with the biggest grin on his face, he shook Captain Russell's hand and said yes.\n\nGuess what happened next! Captain Russell went back to his fort laughing and laughing, because he thought it was the funniest thing in the world that a bunch of farmers wanted to play cricket against his trained soldiers. His assistant kept nervously adjusting his hat. His soldiers slapped each other on the back. Oh, they thought they had already won.\n\nBut Bhuvan got to work straight away.\n\nFirst he needed a team. Now gathering a team was not the easiest thing, because the people of Champaner were all quite different. There was Deva, who was tall and strong and could throw anything very very far. There was Guran, who was a little clumsy but absolutely full of enthusiasm, and every time he tried to catch the ball he would spin around twice and fall over, but he kept getting right back up with a big laugh. There was a man called Bagha who never said much but had the most extraordinary aim you have ever seen. There was Lakha, who was a bit of a grumbler and whose eyebrows always seemed to be in a bad mood, but he could run quite fast when he wanted to.\n\nAnd then, in a lovely twist, there was a girl called Gauri, Bhuvan's best friend from childhood, who was absolutely the most enthusiastic supporter the team had ever had. She cheered so loudly at every single practice that the birds flew off the trees in surprise. She brought everyone water and snacks and made sure nobody gave up when things got hard. She was the heart of the whole team, really.\n\nAnd here is something rather wonderful. Captain Russell had a sister called Elizabeth, who had come to visit. Now Elizabeth was nothing like her brother. She was kind and gentle and she thought her brother's moustache was honestly a bit ridiculous too. When she saw how hard the villagers were working and how much they cared about their home, she wanted to help. She became a great friend to Bhuvan and the team, and she taught them the rules of cricket, drawing little diagrams in the dirt and explaining things very patiently while Guran kept asking the same question over and over again and she answered it every single time with a smile.\n\nSo the team practiced and practiced and practiced. They practiced in the morning when the sun was just waking up. They practiced in the evening when the fireflies came out. There were days when the ball went completely the wrong way and bonked someone on the head and everyone would dissolve into giggles. There were days when they felt tired and wondered if it was all too hard. But then Bhuvan would do that big bright smile of his and say, come on, one more time, and they would all pick themselves up and try again.\n\nCaptain Russell, meanwhile, was absolutely not worried. He was too busy admiring himself in the mirror and telling his soldiers how brilliant they were. His soldiers were actually quite good at cricket, which made things tricky. But you know what? The villagers had something the soldiers didn't have. They were playing for their home. They were playing for their families. They were playing for every hungry tummy and every tired face in Champaner, and that made them brave in a way that's very hard to practice.\n\nFinally, the great big day arrived. Oh, the match was three whole days long! All the villagers came and sat in the sunshine. Some brought little flags. Some brought snacks. The aunties had made enormous amounts of food. There was cheering and gasping and holding of breath.\n\nThe soldiers batted first and they were very good indeed, and for a while it looked quite scary, except nobody was actually scared because Guran kept doing his funny little stumble every time he got excited and it was very hard to feel scared when Guran was around.\n\nThen it was Champaner's turn. And oh, there were some brilliant moments and some heart-in-your-mouth moments. At one point Bhuvan hit the ball so hard it went sailing through the air like a little comet and everyone screamed with joy. At another point the whole team huddled together and Bhuvan said, we've got this, and you could feel the love they all had for each other just shimmering in the air.\n\nCaptain Russell kept making faces from the sidelines. His moustache twitched with irritation. He tried all his cleverest tricks. His best bowler bowled the trickiest balls. But the villagers had practiced so very hard and they knew each other so well and they trusted each other completely.\n\nAnd then, on the very last ball of the very last day, with the whole crowd holding their breath so tightly that not a single person was breathing, Bhuvan stood there with his bat, and he looked at the ball coming toward him, and he swung with everything he had, and CRACK, off it went, soaring up into the blue sky, and it landed way, way out beyond the field, and everyone erupted. Jumping, hugging, crying, laughing, spinning around in circles. Even the grumpy-eyebrowed Lakha had tears running down his face. Guran fell over twice from sheer happiness.\n\nChampaner had won.\n\nCaptain Russell stood there with his mouth hanging open like a fish, and his moustache drooped, and his assistant had to remind him to close his mouth. Then Captain Russell had to do the most difficult thing he had ever done in his very pompous life. He had to admit that the village had won, fair and square. He looked as though he had swallowed something sour. Then he turned around and marched back to his fort, and his snail-curl moustache never looked quite so confident again.\n\nAnd for three whole years, not a single person in the whole region had to pay any lagaan. The rains came back, the crops grew tall and golden, and the village of Champaner was happy and full and grateful. They told the story of that cricket match to their children, and their children told it to their children, and it became the most wonderful legend of the most wonderful village that ever there was.\n\nSo you see, little ones, it doesn't matter if something seems impossible or too hard or too big. If you have good friends beside you, and you're brave enough to try, and you get back up every single time you fall down, just like Guran always did, then anything, anything at all, can happen.\n\nNow close your eyes, my darlings. Let the warm feeling of that big cheering crowd carry you off to sleep. Dream of sunny fields and good friends and the sound of a cricket bat going crack against a ball and sailing up, up, up into the big beautiful sky.\n\nGoodnight, little ones. Goodnight."
}